%层次分析法（AHP）
%%第一个判断矩阵
A1 = [1, 1/4, 2;
     4, 1, 8;
     1/2, 1/8, 1];
[~,n] = size(A1);
x1 = ones(n,100);
y1 = ones(n,100);
m1 = zeros(1,100);
m1(1) = max(x1(:,1));
y1(:,1) = x1(:,1);
x1(:,2) = A1*y1(:,1);
m1(2) = max(x1(:,2));
y1(:,2) = x1(:,2)/m1(2);
p=0.0001; i=2; k=abs(m1(2)-m1(1));
while k>p
    i=i+1;
    x1(:,i) = A1*y1(:,i-1);
    m1(i) = max(x1(:,i));
    y1(:,i) = x1(:,i)/m1(i);
    k=abs(m1(i)-m1(i-1));
end
a1 = sum(y1(:,i));
w1 = y1(:,i)/a1;
t1 = m1(i);
disp(w1);
%一致性检验
CI = (t1-n)/(n-1);
RI = [0 0 0.58 0.9 1.12 1.24 1.41 1.46 1.49 1.52 1.54 1.56 1.58 1.59];
CR = CI/RI(n);
if CR<0.10
    disp('第一个矩阵一致性可以接受！');
    disp('CI=');disp(CI);
    disp('CR=');disp(CR);
end
disp('----------------');
%%第二个判断矩阵
A2 = [1, 4, 1/3;
     1/4, 1, 1/8;
     3, 8, 1];
[~,n] = size(A2);
x2 = ones(n,100);
y2 = ones(n,100);
m2 = zeros(1,100);
m2(1) = max(x2(:,1));
y2(:,1) = x2(:,1);
x2(:,2) = A2*y2(:,1);
m2(2) = max(x2(:,2));
y2(:,2) = x2(:,2)/m2(2);
p=0.0001; i=2; k=abs(m2(2)-m2(1));
while k>p
    i=i+1;
    x2(:,i) = A2*y2(:,i-1);
    m2(i) = max(x2(:,i));
    y2(:,i) = x2(:,i)/m2(i);
    k=abs(m2(i)-m2(i-1));
end
a2 = sum(y2(:,i));
w2 = y2(:,i)/a2;
t2 = m2(i);
disp(w2);
%一致性检验
CI = (t2-n)/(n-1);
RI = [0 0 0.58 0.9 1.12 1.24 1.41 1.46 1.49 1.52 1.54 1.56 1.58 1.59];
CR = CI/RI(n);
if CR<0.10
    disp('第二个矩阵一致性可以接受！');
    disp('CI=');disp(CI);
    disp('CR=');disp(CR);
end
disp('----------------');
%%第三个判断矩阵
A3 = [1, 1, 1/3;
     1, 1, 1/5;
     3, 5, 1];
[~,n] = size(A3);
x3 = ones(n,100);
y3 = ones(n,100);
m3 = zeros(1,100);
m3(1) = max(x3(:,1));
y3(:,1) = x3(:,1);
x3(:,2) = A3*y3(:,1);
m3(2) = max(x3(:,2));
y3(:,2) = x3(:,2)/m3(2);
p=0.0001; i=2; k=abs(m3(2)-m3(1));
while k>p
    i=i+1;
    x3(:,i) = A3*y3(:,i-1);
    m3(i) = max(x3(:,i));
    y3(:,i) = x3(:,i)/m3(i);
    k=abs(m3(i)-m3(i-1));
end
a3 = sum(y3(:,i));
w3 = y3(:,i)/a3;
t3 = m3(i);
disp(w3);
%一致性检验
CI = (t3-n)/(n-1);
RI = [0 0 0.58 0.9 1.12 1.24 1.41 1.46 1.49 1.52 1.54 1.56 1.58 1.59];
CR = CI/RI(n);
if CR<0.10
    disp('第三个矩阵一致性可以接受！');
    disp('CI=');disp(CI);
    disp('CR=');disp(CR);
end
disp('----------------');
%%方案层判断矩阵
A4 = [1, 5, 3;
     1/5, 1, 1/3;
     1/3, 3, 1];
[~,n] = size(A4);
x4 = ones(n,100);
y4 = ones(n,100);
m4 = zeros(1,100);
m4(1) = max(x4(:,1));
y4(:,1) = x4(:,1);
x4(:,2) = A4*y4(:,1);
m4(2) = max(x4(:,2));
y4(:,2) = x4(:,2)/m4(2);
p=0.0001; i=2; k=abs(m4(2)-m4(1));
while k>p
    i=i+1;
    x4(:,i) = A4*y4(:,i-1);
    m4(i) = max(x4(:,i));
    y4(:,i) = x4(:,i)/m4(i);
    k=abs(m4(i)-m4(i-1));
end
a4 = sum(y4(:,i));
w4 = y4(:,i)/a4;
t4 = m4(i);
disp(w4);
%一致性检验
CI = (t4-n)/(n-1);
RI = [0 0 0.58 0.9 1.12 1.24 1.41 1.46 1.49 1.52 1.54 1.56 1.58 1.59];
CR = CI/RI(n);
if CR<0.10
    disp('方案层矩阵一致性可以接受！');
    disp('CI=');disp(CI);
    disp('CR=');disp(CR);
end
disp('----------------');
%%计算求解最优方案
x1 = w4(1)*w1(1)+w4(2)*w2(1)+w4(3)*w3(1);
x2 = w4(1)*w1(2)+w4(2)*w2(2)+w4(3)*w3(2);
x3 = w4(1)*w1(3)+w4(2)*w2(3)+w4(3)*w3(3);
disp(x1);
disp(x2);
disp(x3);
if(x1 > x2 && x1 > x3)
    disp('最大值是');
    disp(x1);
end
if(x2 > x1 && x2 > x3)
    disp('最大值是');
    disp(x2);
end
if(x3 > x1 && x3 > x2)
    disp('最大值是');
    disp(x3);
end

    